updated arch
